package com.example.falehafez


data class Poem(
    var name: String,
    var couplets: List<Couplet>
)

data class Couplet(
    var hemistich_1: String,
    var hemistich_2: String,
)

val poem_1 = Poem(
    name = "غزل شمارهٔ ۲۱",
    couplets = listOf<Couplet>(
        Couplet(
            "دل و دینم شد و دلبر به ملامت برخاست",
            "گفت با ما منشین کز تو سلامت برخاست",
        ),
        Couplet(
            "که شنیدی که در این بزم دمی خوش بنشست",
            "که نه در آخر صحبت به ندامت برخاست",
        ),
        Couplet(
            "شمع اگر زان لب خندان به زبان لافی زد",
            "پیش عشاق تو شب\u200Cها به غرامت برخاست",
        ),
        Couplet(
            "در چمن باد بهاری ز کنار گل و سرو",
            "به هواداری آن عارض و قامت برخاست",
        ),
        Couplet(
            "مست بگذشتی و از خلوتیان ملکوت",
            "به تماشای تو آشوب قیامت برخاست",
        ),
        Couplet(
            "پیش رفتار تو پا برنگرفت از خجلت",
            "سرو سرکش که به ناز از قد و قامت برخاست",
        ),
        Couplet(
            "حافظ این خرقه بینداز مگر جان ببری",
            "کاتش از خرقه سالوس و کرامت برخاست"
        )
    )
)

val poem_2 = Poem(
    name = "غزل شمارهٔ ۴۱",
    couplets = listOf<Couplet>(
        Couplet(
            "اگر چه باده فرح بخش و باد گُل\u200Cبیز است",
            "به بانگِ چنگ مخور می که محتسب تیز است",
        ),
        Couplet(
            "صُراحی ای و حریفی گرت به چنگ افتد",
            "به عقل نوش که ایام، فتنه انگیز است",
        ),
        Couplet(
            "در آستینِ مُرَقَّع، پیاله پنهان کن",
            "که همچو چَشمِ صُراحی زمانه خون\u200Cریز است",
        ),
        Couplet(
            "به آبِ دیده بشوییم خرقه\u200Cها از می",
            "که موسمِ ورع و روزگارِ پرهیز است",
        ),
        Couplet(
            "مجوی عیشِ خوش از دورِ باژگونِ سپهر",
            "که صاف این سَرِ خُم جمله دُردی آمیز است",
        ),
        Couplet(
            "سپهرِ برشده، پرویزنیست خون افشان",
            "که ریزه\u200Cاش سرِ کسری و تاجِ پرویز است",
        ),
        Couplet(
            "عراق و فارس گرفتی به شعر خوش حافظ",
            "بیا که نوبتِ بغداد و وقتِ تبریز است"
        )
    )
)

val poem_3 = Poem(
    name = "غزل شمارهٔ ۸۴",
    couplets = listOf<Couplet>(
        Couplet(
            "ساقی بیار باده که ماهِ صیام رفت",
            "دَردِه قدح که موسمِ ناموس و نام رفت",
        ),
        Couplet(
            "وقتِ عزیز رفت بیا تا قضا کنیم",
            "عمری که بی حضور صُراحی و جام رفت",
        ),
        Couplet(
            "مستم کن آن چنان که ندانم ز بیخودی",
            "در عرصهٔ خیال که آمد، کدام رفت",
        ),
        Couplet(
            "بر بوی آن که جرعهٔ جامت به ما رسد",
            "در مَصطَبِه دعایِ تو هر صبح و شام رفت",
        ),
        Couplet(
            "دل را که مرده بود حیاتی به جان رسید",
            "تا بویی از نسیمِ می\u200Cاش در مشام رفت",
        ),
        Couplet(
            "زاهد غرور داشت، سلامت نبرد راه",
            "رند از رهِ نیاز به دارالسلام رفت",
        ),
        Couplet(
            "نقدِ دلی که بود مرا صرف باده شد",
            "قلبِ سیاه بود از آن در حرام رفت"
        ),
        Couplet(
            "در تابِ توبه چند توان سوخت همچو عود",
            "می ده که عمر در سرِ سودای خام رفت"
        ),
        Couplet(
            "دیگر مکن نصیحتِ حافظ که ره نیافت",
            "گمگشته\u200Cای که بادهٔ نابش به کام رفت"
        )
    )
)


val poem_4 = Poem(
    name = "غزل شمارهٔ ۲۱",
    couplets = listOf<Couplet>(
        Couplet(
            "به سِرِّ جامِ جم آنگه نظر توانی کرد",
            "که خاکِ میکده کُحلِ بَصَر توانی کرد",
        ),
        Couplet(
            "مباش بی می و مُطرب که زیرِ طاقِ سپهر",
            "بدین ترانه غم از دل به در توانی کرد",
        ),
        Couplet(
            "گُلِ مرادِ تو آنگه نقاب بُگْشاید",
            "که خدمتش چو نسیمِ سحر توانی کرد",
        ),
        Couplet(
            "گدایی درِ میخانه طُرفه اِکسیریست",
            "گر این عمل بِکُنی، خاکْ زر توانی کرد",
        ),
        Couplet(
            "به عزمِ مرحلهٔ عشق پیش نِه قدمی",
            "که سودها کنی ار این سفر توانی کرد",
        ),
        Couplet(
            "تو کز سرایِ طبیعت نمی\u200Cروی بیرون",
            "کجا به کویِ طریقت گذر توانی کرد",
        ),
        Couplet(
            "جمالِ یار ندارد نقاب و پرده ولی",
            "غبارِ رَه بِنِشان تا نظر توانی کرد"
        )
    )
)


val poem_5 = Poem(
    name = "غزل شمارهٔ ۲۱",
    couplets = listOf<Couplet>(
        Couplet(
            "دلم جز مِهرِ مَه رویان، طریقی بر نمی\u200Cگیرد",
            "ز هر در می\u200Cدهم پندش، ولیکن در نمی\u200Cگیرد",
        ),
        Couplet(
            "خدا را ای نصیحتگو، حدیثِ ساغر و مِی گو",
            "که نقشی در خیالِ ما، از این خوشتر نمی\u200Cگیرد",
        ),
        Couplet(
            "بیا ای ساقی گُلرُخ، بیاور بادهٔ رنگین",
            "که فکری در درونِ ما، از این بهتر نمی\u200Cگیرد",
        ),
        Couplet(
            "صُراحی می\u200Cکشم پنهان و مردم دفتر انگارند",
            "عجب! گر آتشِ این زَرْق در دفتر نمی\u200Cگیرد",
        ),
        Couplet(
            "من این دَلقِ مُرَقَّع را، بخواهم سوختن روزی",
            "که پیرِ مِی فروشانش، به جامی بر نمی\u200Cگیرد",
        ),
        Couplet(
            "از آن رو هست یاران را، صفاها با مِی لَعلَش",
            "که غیر از راستی نقشی، در آن جوهر نمی\u200Cگیرد",
        ),
        Couplet(
            "سر و چَشمی چُنین دلکَش، تو گویی چشم از او بردوز؟",
            "برو کاین وعظ بی\u200Cمعنی، مرا در سر نمی\u200Cگیرد"
        )
    )
)


val poems = listOf<Poem>(
    poem_1, poem_2, poem_3, poem_4, poem_5
)